function insertionSort(arr) {
    for (let i = 1; i < arr.length; i++) {//外层循环，控制比较次数，从第二个数开始，依次往后比较，
        let key = arr[i]; //用key接收被比较的数
        let j = i - 1; //要进行比较的数
        while (j >= 0 && arr[j] > key) {
            //两者相邻，如果前边的数大于后边的数，那么两者交换，否则不动
            swap(arr, j + 1, j)
            j--   //一次比较后，跳出循环
        }
        //  key = arr[j+1];   //一次循环进行之后，此时循环再进行下去，那么相应的key也要改变       
    }
    return arr;
}
function swap(arr, i, j) {
    [arr[i], arr[j]] = [arr[j], arr[i]]
}
let arr = [0, 1, 1, 1, 4, 5, 3, 7, 7, 8, 10, 2, 7, 8, 0, 5, 2, 16, 12, 1, 19, 15, 5, 18, 2, 2, 22, 15, 8, 22, 17, 6, 22, 6, 22, 26, 32, 8, 10, 11, 2, 26, 9, 12, 9, 7, 28, 33, 20, 7, 2, 17, 44, 3, 52, 27, 2, 23, 19, 56, 56, 58, 36, 31, 1, 19, 19, 6, 65, 49, 27, 63, 29, 1, 69, 47, 56, 61, 40, 43, 10, 71, 60, 66, 42, 44, 10, 12, 83, 69, 73, 2, 65, 93, 92, 47, 35, 39, 13, 75];
insertionSort(arr)
console.log(arr);
